[
  {
    "id": 1,
    "title": "Il est possible de connaître les nouveaux contenus ou services",
    "authors": ["Marco BARONI"],
    "path": "/rules/1",
    "description": "Une image vaut souvent mieux qu’un long discours. Certes, mais tout d’abord, il peut s’avérer difficile de véritablement comprendre un graphique (courbe, diagramme, histogramme, camembert...) si l’on n'a pas les données qui ont permis de le créer. D’autre part, certains utilisateurs ne pourront pas avoir accès au rendu graphique, et l’accès aux données leur permettra de comprendre les contenus.",
    "tags": [
      "Accessibilité",
      "Conception",
      "Contenus",
      "Éditorial",
      "SEO",
      "Écoconception"
    ],
    "objectives": [
      "Permettre aux utilisateurs d'identifier immédiatement les nouveaux contenus ou services en ligne.",
      "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
    ],
    "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
    "implementation": [
      "Publier un flux RSS des actualités du site.",
      "Publier une rubrique du type « Actualités du site » ou « Quoi de neuf ? »",
      "Indiquer un compte de réseau social ou un canal d'actualité où sont publiées les actualités concernant le site."
    ],
    "control": [
      "Vérifier qu’un canal interne existe (flux RSS, rubrique « Quoi de neuf ? », etc.).",
      "Vérifier qu’un canal externe est accessible depuis la page d’accueil (si utilisé)."
    ],
    "screenshotsSources": [
      "https://www.service-public.fr/",
      "https://www.nuxt.com/blog",
      "https://developer.mozilla.org/fr/"
    ]
  },
  {
    "id": 2,
    "title": "Les informations importantes sont accessibles et compréhensibles",
    "path": "/rules/2",
    "tags": [
      "Accessibilité",
      "Conception",
      "Contenus",
      "Éditorial",
      "UX",
      "SEO"
    ],
    "objective": "Assurer que les informations essentielles sont facilement accessibles et compréhensibles pour tous les utilisateurs, y compris ceux ayant des besoins spécifiques."
  },
  {
    "id": 10,
    "title": "Les contenus ou fichiers destinés à des espaces publics peuvent être vérifiés avant leur envoi définitif.",
    "authors": ["Marco BARONI"],
    "path": "/rules/10",
    "description": "Il est fort agaçant de voir publier un message sous une forme dégradée ou de constater après envoi que l’on a écrit une grosse bêtise. La prévisualisation permet de voir les contenus en contexte et donne la possibilité de les corriger ou de les peaufiner.",
    "tags": ["Contenus", "Développement"],
    "objectives": [
      "Permettre à l’utilisateur de vérifier sa saisie en contexte et, si nécessaire, de la corriger avant envoi.",
      "Diminuer le nombre de demandes de rectification ou de suppression."
    ],
    "implementationIntro": "Mettre en place une prévisualisation des informations saisies avant la soumission définitive du formulaire, avec possibilité de les modifier.",
    "implementation": [],
    "control": [
      "Pour chaque espace public du site (zone de commentaire, forum, page personnelle publique, avatar, portfolio de documents, etc.) :",
      "Saisir des informations destinées à être rendues publiques telles que des images associées à un compte ou un commentaire.",
      "Vérifier que la soumission définitive du formulaire de saisie est précédée d'une étape permettant, si l'utilisateur le souhaite, de contrôler et de modifier le résultat de sa saisie avant publication."
    ],
    "screenshotsSources": [
      "https://www.gmail.com/",
      "https://www.nuxt.com/blog",
      "https://developer.mozilla.org/fr/"
    ]
  },{
    "id": 65,
    "title": "Les produits indisponibles font l'objet d'une différenciation visuelle et textuelle",
    "authors": ["Timothé Champieux"],
    "path": "/rules/65",
    "description": "Tout produit qui n'est pas disponible à l'achat doit être clairement distinguable des produits en stock, à la fois par son apparence et par une mention écrite.",
    "tags": ["E-commerce", "Information", "Navigation"],
    "objectives": [
      "Éviter la frustration de l'utilisateur qui tente d'acheter un produit qu'il ne peut pas recevoir.",
      "Permettre à l'utilisateur d'identifier rapidement les produits qu'il peut réellement acquérir.",
      "Renforcer la crédibilité et la transparence du site marchand."
    ],
    "implementationIntro": "La différenciation doit être double : visuelle (pour le scan rapide) et textuelle (pour la certitude et l'accessibilité).",
    "implementation": [
      "Ajouter une mention explicite 'Épuisé', 'Indisponible' ou 'Rupture de stock' visible sans survol.",
      "Modifier l'aspect visuel du produit (opacité réduite, niveau de gris, badge spécifique).",
      "Désactiver le bouton d'ajout au panier et modifier son libellé.",
      "S'assurer que l'information est disponible pour les lecteurs d'écran via du texte caché ou des attributs aria."
    ],
    "control": [
      "Dans les listes de produits, vérifier que les articles hors stock sont visuellement distincts.",
      "Vérifier la présence d'une mention textuelle explicite (pas uniquement une couleur rouge par exemple).",
      "Contrôler que le bouton d'action est désactivé ou remplacé par une alerte."
    ],
    "screenshotsSources": [
      "https://www.amazon.fr/",
      "https://www.decathlon.fr/",
      "https://www.asos.com/fr/"
    ]
  },{
    "id": 66,
    "title": "Un mail indiquant la référence de la transaction et les données de la commande est envoyé suite à la validation",
    "authors": ["Timothé Champieux"],
    "path": "/rules/66",
    "description": "Après validation d'un achat ou d'une commande, l'utilisateur doit recevoir un courriel récapitulatif contenant une référence unique et le détail de sa transaction.",
    "tags": ["E-commerce", "Sécurité", "Confiance"],
    "objectives": [
      "Permettre à l'utilisateur de conserver une trace contractuelle de sa commande.",
      "Rassurer l'utilisateur sur la bonne prise en compte de sa transaction.",
      "Faciliter les échanges ultérieurs avec le service client grâce à la référence."
    ],
    "implementationIntro": "Cet email doit être envoyé automatiquement (transactionnel) immédiatement après le paiement.",
    "implementation": [
      "Configurer le système e-commerce pour envoyer un mail de confirmation automatique.",
      "Inclure impérativement : le numéro de commande, la liste des produits/services, le montant total et les coordonnées du vendeur.",
      "S'assurer que l'email ne tombe pas en spam (authentification SPF/DKIM)."
    ],
    "control": [
      "Effectuer une commande test complète.",
      "Vérifier la réception du mail de confirmation dans les minutes qui suivent.",
      "Contrôler la présence de la référence unique et de l'exactitude des données (produits, prix)."
    ],
    "screenshotsSources": [
      "https://www.amazon.fr/",
      "https://www.fnac.com/",
      "https://www.ubereats.com/"
    ]
  },{
    "id": 67,
    "title": "Chaque réclamation fait l'objet d'un accusé de réception",
    "authors": ["Timothé Champieux"],
    "path": "/rules/67",
    "description": "L'utilisateur doit avoir la certitude immédiate que sa réclamation a été transmise au service concerné via une notification visuelle et/ou un email.",
    "tags": ["Contact", "Service Client", "Feedback"],
    "objectives": [
      "Rassurer l'utilisateur sur la prise en compte de son problème.",
      "Fournir une référence (numéro de ticket) pour le suivi de la demande.",
      "Informer l'utilisateur des délais de traitement prévisibles."
    ],
    "implementationIntro": "L'accusé de réception ne doit pas se contenter d'un simple 'Message envoyé', mais engager la responsabilité du service.",
    "implementation": [
      "Afficher un message de confirmation explicite immédiatement après l'envoi du formulaire.",
      "Envoyer automatiquement un courriel contenant le récapitulatif de la demande et un numéro de dossier.",
      "Indiquer si possible le délai moyen de réponse."
    ],
    "control": [
      "Envoyer une réclamation via le formulaire de contact ou l'interface de support.",
      "Vérifier l'affichage immédiat du message de succès.",
      "Vérifier la réception de l'email de confirmation contenant une référence de suivi."
    ],
    "screenshotsSources": [
      "https://www.ovhcloud.com/fr/",
      "https://www.paypal.com/fr/disputes/",
      "https://www.sncf-connect.com/aide"
    ]
  },{
    "id": 68,
    "title": "La provenance des produits est indiquée",
    "authors": ["Timothé Champieux"],
    "path": "/rules/68",
    "description": "L'origine de fabrication ou d'assemblage des produits vendus doit être clairement affichée sur la fiche produit pour informer le consommateur.",
    "tags": ["E-commerce", "Transparence", "RSE"],
    "objectives": [
      "Permettre au consommateur de faire un choix éclairé (critères éthiques, écologiques, politiques).",
      "Valoriser les circuits courts ou le savoir-faire local.",
      "Renforcer la confiance en affichant une transparence totale sur la chaîne d'approvisionnement."
    ],
    "implementationIntro": "L'information ne doit pas être cachée dans les conditions générales, mais visible directement sur la fiche produit.",
    "implementation": [
      "Ajouter un champ 'Pays de fabrication' ou 'Origine' dans la base de données produits.",
      "Afficher cette information à proximité du prix ou de la description technique.",
      "Si possible, distinguer le lieu de fabrication du lieu de provenance des matières premières."
    ],
    "control": [
      "Naviguer sur plusieurs fiches produits.",
      "Vérifier la présence d'une mention 'Fabriqué en...' ou 'Origine : ...'.",
      "Vérifier que l'information est compréhensible sans ambiguïté."
    ],
    "screenshotsSources": [
      "https://www.leslipfrancais.fr/",
      "https://www.patagonia.com/",
      "https://www.biocoop.fr/"
    ]
  },{
    "id": 69,
    "title": "Chaque champ de formulaire est associé dans le code source à une étiquette qui lui est propre",
    "authors": ["Timothé Champieux"],
    "path": "/rules/69",
    "description": "Tout élément de formulaire permettant une interaction (input, select, textarea) doit être programmatiquement relié à son libellé via l'attribut 'label' ou 'aria-label'.",
    "tags": ["Accessibilité", "Formulaires", "Code"],
    "objectives": [
      "Permettre aux lecteurs d'écran d'annoncer la fonction du champ lorsqu'il reçoit le focus.",
      "Agrandir la zone de clic : cliquer sur le libellé active le champ (très utile sur mobile).",
      "Améliorer le référencement naturel en structurant sémantiquement les formulaires."
    ],
    "implementationIntro": "L'association visuelle (placer le texte à côté du champ) ne suffit pas. L'association doit être dans le code.",
    "implementation": [
      "Utiliser la balise <label> avec l'attribut 'for' pointant vers l'attribut 'id' du champ.",
      "Alternativement, imbriquer le champ <input> directement à l'intérieur de la balise <label>.",
      "Pour les champs sans libellé visible (ex: barre de recherche), utiliser 'aria-label' ou un label caché avec une classe CSS 'sr-only'."
    ],
    "control": [
      "Inspecter le code source et vérifier la correspondance for/id.",
      "Cliquer sur le texte du label : le curseur doit se placer automatiquement dans le champ.",
      "Utiliser un lecteur d'écran (NVDA, VoiceOver) : le nom du champ doit être lu à la prise de focus."
    ],
    "screenshotsSources": [
      "https://www.service-public.fr/",
      "https://github.com/signup",
      "https://accounts.google.com/"
    ]
  },{
    "id": 70,
    "title": "Les informations complétant l'étiquette d'un champ sont associées à celui-ci dans le code source",
    "authors": ["Timothé Champieux"],
    "path": "/rules/70",
    "description": "Lorsque des informations supplémentaires (format de saisie, message d'erreur, unité de mesure) accompagnent un champ, elles doivent être reliées techniquement à celui-ci pour être perçues par les technologies d'assistance.",
    "tags": ["Accessibilité", "Formulaires", "WAI-ARIA"],
    "objectives": [
      "Permettre aux utilisateurs non-voyants de connaître le format attendu (ex: JJ/MM/AAAA) avant de remplir le champ.",
      "Garantir que les messages d'erreur sont lus automatiquement lorsque l'utilisateur corrige sa saisie.",
      "Éviter les erreurs de saisie en rendant les contraintes explicites pour tous."
    ],
    "implementationIntro": "La simple proximité visuelle ne suffit pas. L'utilisation de l'attribut ARIA 'aria-describedby' est la méthode standard.",
    "implementation": [
      "Attribuer un 'id' unique à l'élément contenant le texte d'aide ou l'erreur.",
      "Ajouter l'attribut 'aria-describedby' sur le champ <input>, <select> ou <textarea>.",
      "Faire pointer cet attribut vers l'identifiant du texte d'aide (ex: aria-describedby='help-text-id')."
    ],
    "control": [
      "Inspecter le code source : vérifier la présence de 'aria-describedby'.",
      "Vérifier que la valeur de cet attribut correspond bien à un 'id' existant dans la page.",
      "Tester avec un lecteur d'écran : l'aide doit être vocalisée après le label lors de la prise de focus."
    ],
    "screenshotsSources": [
      "https://www.service-public.fr/",
      "https://getbootstrap.com/docs/5.3/forms/overview/",
      "https://github.com/signup"
    ]
  },{
    "id": 71,
    "title": "L'étiquette de chaque champ de formulaire indique si la saisie est obligatoire",
    "authors": ["Timothé Champieux"],
    "path": "/rules/71",
    "description": "L'utilisateur doit pouvoir distinguer immédiatement les champs qu'il est obligé de remplir de ceux qui sont optionnels, avant même de valider le formulaire.",
    "tags": ["Formulaires", "Accessibilité", "Ergonomie"],
    "objectives": [
      "Prévenir les erreurs de saisie lors de la validation du formulaire.",
      "Accélérer le remplissage en permettant à l'utilisateur de n'aller qu'à l'essentiel.",
      "Garantir l'accessibilité de l'information pour les utilisateurs de lecteurs d'écran."
    ],
    "implementationIntro": "La convention la plus courante est l'astérisque, mais la mention explicite '(obligatoire)' ou '(facultatif)' fonctionne aussi.",
    "implementation": [
      "Ajouter un signe distinctif (astérisque, mention texte) dans le libellé <label>.",
      "Si un symbole est utilisé (comme *), ajouter une légende explicative en début de formulaire.",
      "Ajouter l'attribut standard 'required' dans la balise <input>.",
      "Utiliser 'aria-required=\"true\"' si l'attribut HTML5 ne suffit pas dans certains contextes complexes."
    ],
    "control": [
      "Vérifier visuellement la présence de l'indicateur sur tous les champs obligatoires.",
      "Vérifier la présence de la légende si un symbole est utilisé.",
      "Vérifier la présence de l'attribut 'required' dans le code source."
    ],
    "screenshotsSources": [
      "https://www.laposte.fr/",
      "https://www.service-public.fr/",
      "https://www.fnac.com/"
    ]
  },
  {
    "id": 87,
    "title": "Les processus complexes sont accompagnés de la liste de leurs étapes.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/87",
    "description": "Il est toujours appréciable de connaître à l’avance le nombre d’étapes et de pouvoir estimer le temps nécessaire pour réaliser une longue démarche",
    "tags": ["Basics", "Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Donner de la visibilité à l'utilisateur sur les actions qu'il va réaliser (ordre des étapes, informations nécessaires pour les accomplir, etc.). ",
      "Éviter que l'utilisateur ne se sente piégé dans un processus dont il n'avait pas prévu la durée."
    ],
    "implementationIntro": "Pour tout processus complexe, par exemple un formulaire de commande, afficher à chaque étape la liste intégrale de toutes ses étapes.",
    "implementation": [],
    "control": [
      "Vérifier, pour chaque page concernée, que la liste des étapes y est indiquée, en règle générale sous forme d'un chemin d'étapes en tête de page ou de formulaire."
    ],
    "screenshotsSources": []
  },
  {
    "id": 88,
    "title": "L'étape en cours d'un processus complexe est indiquée.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/88",
    "description": "Ne vous êtes-vous jamais demandé, au beau milieu d’une démarche un peu longue répartie sur plusieurs formulaires successifs, où vous étiez exactement ?",
    "tags": ["Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Permettre à l'utilisateur d'identifier le degré d'avancement dans un processus.",
      "Rassurer l'utilisateur lors de la réalisation d'un processus complexe."
    ],
    "implementationIntro": "Préciser sur chaque page du processus l'étape correspondant à la page en cours.",
    "implementation": [],
    "control": [
      "Dans le cas de processus complexes, vérifier, pour chaque page concernée, que l'étape en cours y est indiquée",
      "Dans le titre de page",
      "Dans le contenu de page, sous la forme d'une mise en évidence dans le chemin d'étapes en tête de page ou de formulaire, par exemple « Étape 2 – Coordonnées » ou « Étape 4 – Paiement »."
    ],
    "screenshotsSources": []
  },
  {
    "id": 89,
    "title": "Chaque étape d'un processus complexe permet de revenir à l'étape précédente.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/89",
    "description": "Après avoir décidé de passer à l’étape suivante d’un processus complexe, il arrive souvent d’avoir besoin de vérifier ce qu’on a saisi précédemment. Laissez aux internautes la possibilité de douter, de vérifier, et de se tromper, bien sûr.",
    "tags": ["Accessibilité","Développement", "Conception", "Formulaires"],
    "objectives": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Réduire les risques d’erreurs de saisie. Limiter les risques d’abandon en cours de processus."
    ],
    "implementationIntro": "Fournir à chaque étape du formulaire un bouton de navigation permettant de retourner à l’étape précédente.",
    "implementation": [],
    "control": [
      "Vérifier manuellement la possibilité de revenir à chaque étape précédente du processus."
    ],
    "screenshotsSources": []
  },
  {
    "id": 90,
    "title": "L'utilisateur est averti de la perte d'information en cas d'utilisation de l'historique de son navigateur dans un processus complexe.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/90",
    "description": "Ne vous est-il jamais arrivé de croire que vous pouviez tout simplement retourner voir ce que vous aviez saisi à l’étape précédente lors de votre déclaration d’impôts, par exemple, et de constater peu après que tout ce que vous aviez saisi avant ce remords était perdu ? Évitons ce genre de déception à nos utilisateurs.",
    "tags": ["Basics", "Accessibilité", "Conception","Développement", "Formulaires"],
    "objectives": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Limiter les risques d’abandon en cours de processus."
    ],
    "implementationIntro": "Générer une alerte JavaScript en cas de l’utilisation de la fonctionnalité « back » de l’historique du navigateur. ",
    "implementation": [],
    "control": [
      "Amorcer la saisie d’un formulaire après la première étape du processus, puis activer le bouton « back » du navigateur."
    ],
    "screenshotsSources": []
  },
  {
    "id": 91,
    "title": "La navigation dans un processus complexe ne provoque pas la perte des données précédemment soumises.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/91",
    "description": "Il est certes extrêmement confortable pour l’utilisateur de pouvoir naviguer dans les différentes étapes d’un processus complexe. Il est évidemment essentiel de l’avertir lorsque des données peuvent être perdues. C’est d’ailleurs l’objet d’une autre des règles assurance qualité web. Il est encore plus utile de s’assurer que l’ensemble des données saisies par l’utilisateur sont enregistrées à tout moment.",
    "tags": ["Développement", "Formulaires"],
    "objectives": [
      "Faciliter la saisie et sa correction dans les formulaires répartis par étapes.",
      "Limiter les risques d’abandon en cours de procédure."
    ],
    "implementationIntro": "Prévoir, au niveau de la gestion de la navigation dans les étapes du processus, l’enregistrement des données saisies à chaque étape, de manière à pouvoir afficher à nouveau celle-ci sans perte de données après que l’utilisateur a utilisé le mécanisme de navigation dans les étap",
    "implementation": [],
    "control": [
      "Utiliser le mécanisme de navigation dans les étapes précédentes de la saisie et vérifier manuellement que les données saisies à chaque étape sont conservées et affichées à nouveau par la suite. "
    ],
    "screenshotsSources": []
  },
  {
    "id": 92,
    "title": "Le copier coller est possible dans les champs de formulaire.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/92",
    "description": "Saisissez votre adresse e-mail. C’est bon, c’est fait ? Et si maintenant je vous demande de la saisir de nouveau, vous allez peut-être avoir la flemme de le faire et voudrez la copier depuis le premier champ pour la coller dans le deuxième. De quel droit certains sites voudraient-ils vous empêcher de faire cela ? Vive le copier-coller libre !",
    "tags": ["Basics", "Accessibilité", "Développement", "Formulaires"],
    "objectives": [
      "Faciliter la saisie dans les formulaires."
    ],
    "implementationIntro": "",
    "implementation": [
      "Ne pas intercepter les événements JavaScript onpaste ou keydown pour bloquer le coller dans un champ de formulaire.",
      "Ne pas intercepter les événements JavaScript oncopy ou oncut pour bloquer le copier dans un champ de formulaire."
    ],
    "control": [
      "Vérifier qu’il est possible de copier le contenu de chaque champ y compris les champs de type password (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire).",
      "Vérifier qu’il est possible de coller un contenu dans chaque champ y compris dans les champs de type password (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire)."
    ],
    "screenshotsSources": []
  },
  {
    "id": 93,
    "title": "Les éléments d'une liste déroulante qui peuvent être regroupés le sont de manière appropriée.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/93",
    "description": "Le contenu de certaines listes déroulantes est suffisamment homogène pour se suffire à lui-même, mais, dans certains cas, la liste sera plus aisée à consulter en étant mieux organisée. Dans ce cas, l’élément optgroup est votre ami.",
    "tags": ["Basics", "Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Permettre aux aides techniques de restituer à l’utilisateur une liste dont l’organisation est clairement perceptible et qui facilite le passage d’un élément de la liste à un autre.",
      "Favoriser un rendu approprié des listes déroulantes complexes dans tous les navigateurs.",
      "Améliorer l’accessibilité des contenus aux personnes handicapées"
    ],
    "implementationIntro": "",
    "implementation": [
      "Utiliser l'élément optgroup pour baliser les regroupements thématiques d'éléments option dans les listes sel",
      "Utiliser l'attribut label de l'élément optgroup pour afficher l'étiquette de chaque regroupement."
    ],
    "control": [
      "Ouvrir chaque liste (select) pour détecter celles qui nécessiteraient un regroupement d'éléments option, par exemple des regroupements de modèles de voitures classés par marques ou des regroupements de villes réalisés par département ",
      "Vérifier, en examinant le code source à l'aide de Firebug, que chaque série d'éléments option qui devraient être regroupés est balisée avec l'élément optgroup",
      "Vérifier que chaque élément optgroup est doté d'un attribut label associant un libellé pertinent au groupe d'options concern"
    ],
    "screenshotsSources": []
  }
  
]
