[
  {
    "id": 1,
    "title": "Il est possible de connaître les nouveaux contenus ou services",
    "authors": ["Marco BARONI"],
    "path": "/rules/1",
    "description": "Une image vaut souvent mieux qu’un long discours. Certes, mais tout d’abord, il peut s’avérer difficile de véritablement comprendre un graphique (courbe, diagramme, histogramme, camembert...) si l’on n'a pas les données qui ont permis de le créer. D’autre part, certains utilisateurs ne pourront pas avoir accès au rendu graphique, et l’accès aux données leur permettra de comprendre les contenus.",
    "tags": [
      "Accessibilité",
      "Conception",
      "Contenus",
      "Éditorial",
      "SEO",
      "Écoconception"
    ],
    "objectives": [
      "Permettre aux utilisateurs d'identifier immédiatement les nouveaux contenus ou services en ligne.",
      "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
    ],
    "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
    "implementation": [
      "Publier un flux RSS des actualités du site.",
      "Publier une rubrique du type « Actualités du site » ou « Quoi de neuf ? »",
      "Indiquer un compte de réseau social ou un canal d'actualité où sont publiées les actualités concernant le site."
    ],
    "control": [
      "Vérifier qu’un canal interne existe (flux RSS, rubrique « Quoi de neuf ? », etc.).",
      "Vérifier qu’un canal externe est accessible depuis la page d’accueil (si utilisé)."
    ],
    "screenshotsSources": [
      "https://www.service-public.fr/",
      "https://www.nuxt.com/blog",
      "https://developer.mozilla.org/fr/"
    ]
  },
  {
    "id": 2,
    "title": "Les informations importantes sont accessibles et compréhensibles",
    "path": "/rules/2",
    "tags": [
      "Accessibilité",
      "Conception",
      "Contenus",
      "Éditorial",
      "UX",
      "SEO"
    ],
    "objective": "Assurer que les informations essentielles sont facilement accessibles et compréhensibles pour tous les utilisateurs, y compris ceux ayant des besoins spécifiques."
  },
  {
    "id": 10,
    "title": "Les contenus ou fichiers destinés à des espaces publics peuvent être vérifiés avant leur envoi définitif.",
    "authors": ["Marco BARONI"],
    "path": "/rules/10",
    "description": "Il est fort agaçant de voir publier un message sous une forme dégradée ou de constater après envoi que l’on a écrit une grosse bêtise. La prévisualisation permet de voir les contenus en contexte et donne la possibilité de les corriger ou de les peaufiner.",
    "tags": ["Contenus", "Développement"],
    "objectives": [
      "Permettre à l’utilisateur de vérifier sa saisie en contexte et, si nécessaire, de la corriger avant envoi.",
      "Diminuer le nombre de demandes de rectification ou de suppression."
    ],
    "implementationIntro": "Mettre en place une prévisualisation des informations saisies avant la soumission définitive du formulaire, avec possibilité de les modifier.",
    "implementation": [],
    "control": [
      "Pour chaque espace public du site (zone de commentaire, forum, page personnelle publique, avatar, portfolio de documents, etc.) :",
      "Saisir des informations destinées à être rendues publiques telles que des images associées à un compte ou un commentaire.",
      "Vérifier que la soumission définitive du formulaire de saisie est précédée d'une étape permettant, si l'utilisateur le souhaite, de contrôler et de modifier le résultat de sa saisie avant publication."
    ],
    "screenshotsSources": [
      "https://www.gmail.com/",
      "https://www.nuxt.com/blog",
      "https://developer.mozilla.org/fr/"
    ]
  },
  {
    "id": 87,
    "title": "Les processus complexes sont accompagnés de la liste de leurs étapes.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/87",
    "description": "Il est toujours appréciable de connaître à l’avance le nombre d’étapes et de pouvoir estimer le temps nécessaire pour réaliser une longue démarche",
    "tags": ["Basics", "Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Donner de la visibilité à l'utilisateur sur les actions qu'il va réaliser (ordre des étapes, informations nécessaires pour les accomplir, etc.). ",
      "Éviter que l'utilisateur ne se sente piégé dans un processus dont il n'avait pas prévu la durée."
    ],
    "implementationIntro": "Pour tout processus complexe, par exemple un formulaire de commande, afficher à chaque étape la liste intégrale de toutes ses étapes.",
    "implementation": [],
    "control": [
      "Vérifier, pour chaque page concernée, que la liste des étapes y est indiquée, en règle générale sous forme d'un chemin d'étapes en tête de page ou de formulaire."
    ],
    "screenshotsSources": []
  },
  {
    "id": 88,
    "title": "L'étape en cours d'un processus complexe est indiquée.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/88",
    "description": "Ne vous êtes-vous jamais demandé, au beau milieu d’une démarche un peu longue répartie sur plusieurs formulaires successifs, où vous étiez exactement ?",
    "tags": ["Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Permettre à l'utilisateur d'identifier le degré d'avancement dans un processus.",
      "Rassurer l'utilisateur lors de la réalisation d'un processus complexe."
    ],
    "implementationIntro": "Préciser sur chaque page du processus l'étape correspondant à la page en cours.",
    "implementation": [],
    "control": [
      "Dans le cas de processus complexes, vérifier, pour chaque page concernée, que l'étape en cours y est indiquée",
      "Dans le titre de page",
      "Dans le contenu de page, sous la forme d'une mise en évidence dans le chemin d'étapes en tête de page ou de formulaire, par exemple « Étape 2 – Coordonnées » ou « Étape 4 – Paiement »."
    ],
    "screenshotsSources": []
  },
  {
    "id": 89,
    "title": "Chaque étape d'un processus complexe permet de revenir à l'étape précédente.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/89",
    "description": "Après avoir décidé de passer à l’étape suivante d’un processus complexe, il arrive souvent d’avoir besoin de vérifier ce qu’on a saisi précédemment. Laissez aux internautes la possibilité de douter, de vérifier, et de se tromper, bien sûr.",
    "tags": ["Accessibilité","Développement", "Conception", "Formulaires"],
    "objectives": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Réduire les risques d’erreurs de saisie. Limiter les risques d’abandon en cours de processus."
    ],
    "implementationIntro": "Fournir à chaque étape du formulaire un bouton de navigation permettant de retourner à l’étape précédente.",
    "implementation": [],
    "control": [
      "Vérifier manuellement la possibilité de revenir à chaque étape précédente du processus."
    ],
    "screenshotsSources": []
  },
  {
    "id": 90,
    "title": "L'utilisateur est averti de la perte d'information en cas d'utilisation de l'historique de son navigateur dans un processus complexe.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/90",
    "description": "Ne vous est-il jamais arrivé de croire que vous pouviez tout simplement retourner voir ce que vous aviez saisi à l’étape précédente lors de votre déclaration d’impôts, par exemple, et de constater peu après que tout ce que vous aviez saisi avant ce remords était perdu ? Évitons ce genre de déception à nos utilisateurs.",
    "tags": ["Basics", "Accessibilité", "Conception","Développement", "Formulaires"],
    "objectives": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Limiter les risques d’abandon en cours de processus."
    ],
    "implementationIntro": "Générer une alerte JavaScript en cas de l’utilisation de la fonctionnalité « back » de l’historique du navigateur. ",
    "implementation": [],
    "control": [
      "Amorcer la saisie d’un formulaire après la première étape du processus, puis activer le bouton « back » du navigateur."
    ],
    "screenshotsSources": []
  },
  {
    "id": 91,
    "title": "La navigation dans un processus complexe ne provoque pas la perte des données précédemment soumises.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/91",
    "description": "Il est certes extrêmement confortable pour l’utilisateur de pouvoir naviguer dans les différentes étapes d’un processus complexe. Il est évidemment essentiel de l’avertir lorsque des données peuvent être perdues. C’est d’ailleurs l’objet d’une autre des règles assurance qualité web. Il est encore plus utile de s’assurer que l’ensemble des données saisies par l’utilisateur sont enregistrées à tout moment.",
    "tags": ["Développement", "Formulaires"],
    "objectives": [
      "Faciliter la saisie et sa correction dans les formulaires répartis par étapes.",
      "Limiter les risques d’abandon en cours de procédure."
    ],
    "implementationIntro": "Prévoir, au niveau de la gestion de la navigation dans les étapes du processus, l’enregistrement des données saisies à chaque étape, de manière à pouvoir afficher à nouveau celle-ci sans perte de données après que l’utilisateur a utilisé le mécanisme de navigation dans les étap",
    "implementation": [],
    "control": [
      "Utiliser le mécanisme de navigation dans les étapes précédentes de la saisie et vérifier manuellement que les données saisies à chaque étape sont conservées et affichées à nouveau par la suite. "
    ],
    "screenshotsSources": []
  },
  {
    "id": 92,
    "title": "Le copier coller est possible dans les champs de formulaire.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/92",
    "description": "Saisissez votre adresse e-mail. C’est bon, c’est fait ? Et si maintenant je vous demande de la saisir de nouveau, vous allez peut-être avoir la flemme de le faire et voudrez la copier depuis le premier champ pour la coller dans le deuxième. De quel droit certains sites voudraient-ils vous empêcher de faire cela ? Vive le copier-coller libre !",
    "tags": ["Basics", "Accessibilité", "Développement", "Formulaires"],
    "objectives": [
      "Faciliter la saisie dans les formulaires."
    ],
    "implementationIntro": "",
    "implementation": [
      "Ne pas intercepter les événements JavaScript onpaste ou keydown pour bloquer le coller dans un champ de formulaire.",
      "Ne pas intercepter les événements JavaScript oncopy ou oncut pour bloquer le copier dans un champ de formulaire."
    ],
    "control": [
      "Vérifier qu’il est possible de copier le contenu de chaque champ y compris les champs de type password (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire).",
      "Vérifier qu’il est possible de coller un contenu dans chaque champ y compris dans les champs de type password (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire)."
    ],
    "screenshotsSources": []
  },
  {
    "id": 93,
    "title": "Les éléments d'une liste déroulante qui peuvent être regroupés le sont de manière appropriée.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/93",
    "description": "Le contenu de certaines listes déroulantes est suffisamment homogène pour se suffire à lui-même, mais, dans certains cas, la liste sera plus aisée à consulter en étant mieux organisée. Dans ce cas, l’élément optgroup est votre ami.",
    "tags": ["Basics", "Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Permettre aux aides techniques de restituer à l’utilisateur une liste dont l’organisation est clairement perceptible et qui facilite le passage d’un élément de la liste à un autre.",
      "Favoriser un rendu approprié des listes déroulantes complexes dans tous les navigateurs.",
      "Améliorer l’accessibilité des contenus aux personnes handicapées"
    ],
    "implementationIntro": "",
    "implementation": [
      "Utiliser l'élément optgroup pour baliser les regroupements thématiques d'éléments option dans les listes sel",
      "Utiliser l'attribut label de l'élément optgroup pour afficher l'étiquette de chaque regroupement."
    ],
    "control": [
      "Ouvrir chaque liste (select) pour détecter celles qui nécessiteraient un regroupement d'éléments option, par exemple des regroupements de modèles de voitures classés par marques ou des regroupements de villes réalisés par département ",
      "Vérifier, en examinant le code source à l'aide de Firebug, que chaque série d'éléments option qui devraient être regroupés est balisée avec l'élément optgroup",
      "Vérifier que chaque élément optgroup est doté d'un attribut label associant un libellé pertinent au groupe d'options concern"
    ],
    "screenshotsSources": []
  },

  {
  "id": 124,
  "title": "Les vidéos sont déclenchées par l’utilisateur",
  "authors": ["Opquast"],
  "path": "/rules/124",
  "description": "Les vidéos ne doivent pas se lancer automatiquement sans action explicite de l’utilisateur. Le déclenchement automatique peut perturber la navigation, nuire à l’accessibilité et générer une surcharge cognitive ou sensorielle, notamment pour les personnes utilisant des technologies d’assistance.",
  "tags": [
    "Accessibilité",
    "Développement",
    "Images et médias",
    "Écoconception",
    "UX"
  ],
  "objectives": [
    "Laisser à l’utilisateur le contrôle de la lecture des contenus vidéo.",
    "Éviter les distractions et les perturbations lors de la navigation.",
    "Améliorer l’accessibilité des pages contenant des médias."
  ],
  "implementationIntro": "Pour respecter cette règle, les bonnes pratiques suivantes peuvent être mises en œuvre :",
  "implementation": [
    "Ne pas utiliser de lecture automatique des vidéos au chargement de la page.",
    "Éviter l’attribut autoplay sur les balises vidéo.",
    "Fournir des contrôles visibles permettant de lancer, mettre en pause ou arrêter la vidéo.",
    "S’assurer que la lecture d’une vidéo ne se déclenche qu’après une action volontaire de l’utilisateur."
  ],
  "control": [
    "Vérifier qu’aucune vidéo ne démarre automatiquement à l’ouverture de la page.",
    "Vérifier que la lecture d’une vidéo ne se déclenche pas sans intention explicite de l’utilisateur.",
    "Tester la page avec différents navigateurs et dispositifs pour confirmer le comportement."
  ],
  "screenshotsSources": [
    "https://developer.mozilla.org/fr/docs/Web/HTML/Element/video"
  ]
},
{
  "id": 125,
  "title": "Les sons sont déclenchés par l’utilisateur",
  "authors": ["Opquast"],
  "path": "/rules/125",
  "description": "Les contenus sonores ne doivent pas se lancer automatiquement sans action explicite de l’utilisateur. Un déclenchement automatique du son peut gêner la navigation, perturber la compréhension des contenus et poser des problèmes d’accessibilité.",
  "tags": [
    "Accessibilité",
    "Développement",
    "Audio",
    "UX",
    "Écoconception"
  ],
  "objectives": [
    "Permettre à l’utilisateur de garder le contrôle de la diffusion des contenus sonores.",
    "Éviter les nuisances sonores involontaires lors de la consultation des pages.",
    "Améliorer l’accessibilité des contenus audio."
  ],
  "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
  "implementation": [
    "Ne pas déclencher automatiquement la lecture d’un son au chargement de la page.",
    "Éviter l’utilisation de sons en lecture automatique (autoplay).",
    "Proposer des contrôles visibles permettant de lancer, mettre en pause ou arrêter le son.",
    "S’assurer que la diffusion sonore démarre uniquement après une action volontaire de l’utilisateur."
  ],
  "control": [
    "Vérifier qu’aucun son ne se déclenche automatiquement à l’ouverture d’une page.",
    "Vérifier que la lecture d’un contenu sonore nécessite toujours une action explicite de l’utilisateur."
  ],
  "screenshotsSources": [
    "https://developer.mozilla.org/fr/docs/Web/HTML/Element/audio",
    "https://www.radiofrance.fr/",
    "https://www.bbc.co.uk/sounds"
  ]
},
{
  "id": 126,
  "title": "Les animations sont déclenchées par l’utilisateur",
  "authors": ["Opquast"],
  "path": "/rules/126",
  "description": "Les animations ne doivent pas se déclencher automatiquement sans action explicite de l’utilisateur. Des animations lancées sans contrôle peuvent perturber la navigation, distraire l’utilisateur et poser des problèmes d’accessibilité, notamment pour les personnes sensibles aux mouvements.",
  "tags": [
    "Accessibilité",
    "Développement",
    "Animations",
    "UX",
    "Écoconception"
  ],
  "objectives": [
    "Permettre à l’utilisateur de garder le contrôle des animations.",
    "Limiter les distractions et les perturbations visuelles lors de la navigation.",
    "Améliorer l’accessibilité pour les utilisateurs sensibles aux animations."
  ],
  "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
  "implementation": [
    "Ne pas déclencher automatiquement les animations au chargement de la page.",
    "Éviter les animations non sollicitées (GIF animés, effets CSS ou JavaScript automatiques).",
    "Proposer un mécanisme explicite pour lancer ou arrêter une animation.",
    "Respecter les préférences utilisateur, notamment le réglage « réduire les animations » du système."
  ],
  "control": [
    "Vérifier qu’aucune animation ne démarre automatiquement à l’ouverture d’une page.",
    "Vérifier que les animations nécessitent toujours une action explicite de l’utilisateur ou peuvent être désactivées."
  ],
  "screenshotsSources": [
    "https://developer.mozilla.org/fr/docs/Web/CSS/@media/prefers-reduced-motion",
    "https://www.gov.uk/",
    "https://design-system.service.gov.uk/"
  ]
},
{
  "id": 127,
  "title": "Les contenus animés peuvent être arrêtés",
  "authors": ["Opquast"],
  "path": "/rules/127",
  "description": "Les contenus animés présents sur une page doivent pouvoir être arrêtés, mis en pause ou masqués par l’utilisateur. L’impossibilité de contrôler une animation peut nuire à la compréhension des contenus et poser des problèmes d’accessibilité.",
  "tags": [
    "Accessibilité",
    "Développement",
    "Animations",
    "UX",
    "Écoconception"
  ],
  "objectives": [
    "Permettre à l’utilisateur de contrôler l’affichage des contenus animés.",
    "Éviter les distractions visuelles persistantes.",
    "Améliorer l’accessibilité des pages contenant des animations."
  ],
  "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
  "implementation": [
    "Proposer un bouton ou un mécanisme permettant de mettre en pause ou d’arrêter une animation.",
    "Permettre la désactivation des animations via un réglage global ou une préférence utilisateur.",
    "Limiter la durée des animations lorsque leur arrêt n’est pas possible.",
    "Respecter les préférences utilisateur, notamment le réglage « réduire les animations » du système."
  ],
  "control": [
    "Vérifier que chaque contenu animé peut être arrêté, mis en pause ou masqué par l’utilisateur.",
    "Vérifier que l’arrêt ou la mise en pause est simple et accessible."
  ],
  "screenshotsSources": [
    "https://developer.mozilla.org/fr/docs/Web/CSS/@media/prefers-reduced-motion",
    "https://www.w3.org/WAI/WCAG21/Understanding/pause-stop-hide.html",
    "https://www.gov.uk/"
  ]
},
{
  "id": 128,
  "title": "Les clignotements sont évités",
  "authors": ["Opquast"],
  "path": "/rules/128",
  "description": "Les contenus qui clignotent ou scintillent doivent être évités. Les clignotements peuvent provoquer une gêne visuelle, perturber la navigation et, dans certains cas, présenter un risque pour les personnes photosensibles.",
  "tags": [
    "Accessibilité",
    "Développement",
    "Animations",
    "UX",
    "Écoconception"
  ],
  "objectives": [
    "Éviter les risques liés aux contenus clignotants ou scintillants.",
    "Limiter les gênes visuelles et les distractions.",
    "Améliorer l’accessibilité pour les utilisateurs photosensibles."
  ],
  "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
  "implementation": [
    "Éviter l’utilisation de contenus clignotants ou scintillants.",
    "Limiter strictement la fréquence des clignotements lorsqu’ils sont indispensables.",
    "Remplacer les clignotements par des effets visuels statiques ou plus discrets.",
    "Respecter les recommandations d’accessibilité concernant les contenus susceptibles de provoquer des crises."
  ],
  "control": [
    "Vérifier l’absence de contenus clignotants ou scintillants dangereux.",
    "Vérifier que les éventuels clignotements respectent les seuils d’accessibilité recommandés."
  ],
  "screenshotsSources": [
    "https://www.w3.org/WAI/WCAG21/Understanding/seizures-and-physical-reactions.html",
    "https://developer.mozilla.org/fr/docs/Web/CSS/animation",
    "https://www.gov.uk/"
  ]
},
{
  "id": 129,
  "title": "Les animations essentielles sont conservées",
  "authors": ["Opquast"],
  "path": "/rules/129",
  "description": "Lorsque des animations sont utilisées pour transmettre une information essentielle ou faciliter la compréhension, elles doivent être conservées ou remplacées par une alternative équivalente. La suppression totale des animations ne doit pas entraîner une perte d’information.",
  "tags": [
    "Accessibilité",
    "Développement",
    "Animations",
    "UX",
    "Écoconception"
  ],
  "objectives": [
    "Garantir l’accès à l’information même en cas de désactivation des animations.",
    "Préserver les animations lorsqu’elles jouent un rôle fonctionnel ou informatif.",
    "Assurer une compréhension équivalente des contenus avec ou sans animation."
  ],
  "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
  "implementation": [
    "Identifier les animations ayant un rôle fonctionnel ou informatif.",
    "Prévoir une alternative statique ou textuelle lorsque les animations sont désactivées.",
    "S’assurer que la désactivation des animations n’entraîne pas de perte de compréhension.",
    "Tester les interfaces avec les animations réduites ou désactivées."
  ],
  "control": [
    "Vérifier que les informations essentielles restent accessibles sans animation.",
    "Vérifier que les animations utiles ne sont pas supprimées sans solution de remplacement."
  ],
  "screenshotsSources": [
    "https://developer.mozilla.org/fr/docs/Web/CSS/@media/prefers-reduced-motion",
    "https://design-system.service.gov.uk/",
    "https://www.numerique.gouv.fr/"
  ]
},
{
  "id": 130,
  "title": "Les effets de défilement sont maîtrisés",
  "authors": ["Opquast"],
  "path": "/rules/130",
  "description": "Les effets liés au défilement (parallax, déclenchements automatiques, animations liées au scroll) doivent être utilisés avec modération et ne pas perturber la navigation. Des effets excessifs peuvent nuire à l’accessibilité et à la compréhension des contenus.",
  "tags": [
    "Accessibilité",
    "Développement",
    "Animations",
    "UX",
    "Écoconception"
  ],
  "objectives": [
    "Éviter les effets de défilement perturbants ou envahissants.",
    "Permettre une navigation fluide et prévisible.",
    "Améliorer l’accessibilité pour les utilisateurs sensibles aux mouvements."
  ],
  "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
  "implementation": [
    "Limiter l’utilisation d’effets de défilement complexes ou envahissants.",
    "Éviter les animations déclenchées automatiquement lors du scroll.",
    "Proposer une alternative ou une désactivation des effets de défilement.",
    "Respecter les préférences utilisateur, notamment le réglage « réduire les animations » du système."
  ],
  "control": [
    "Vérifier que les effets de défilement ne gênent pas la lecture ou la navigation.",
    "Vérifier que les effets peuvent être désactivés ou n’entraînent pas de perte d’information."
  ],
  "screenshotsSources": [
    "https://developer.mozilla.org/fr/docs/Web/CSS/@media/prefers-reduced-motion",
    "https://www.apple.com/fr/",
    "https://www.gov.uk/"
  ]
}
]

